CSI API ETABS v1
cDesignConcrete.StartDesign Method
 Starts the concrete frame design.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int StartDesign()
Function StartDesign As Integer
Dim instance As cDesignConcrete
Dim returnValue As Integer
returnValue = instance.StartDesign()
int StartDesign()
abstract StartDesign : unit -> int
Return Value
Type: Int32
 Returns zero if the concrete frame design is successfully started; otherwise it returns a nonzero value.
Remarks
 The function will fail if no concrete frame objects are present. It also will fail if analysis results are not available.
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'create new concrete frame section property
   ret = SapModel.PropFrame.SetRectangle("R1", "4000Psi", 20, 12)
'set frame section property
   ret = SapModel.FrameObj.SetSection("8", "R1")
'set concrete design code
   ret = SapModel.DesignConcrete.SetCode("ACI 318-08/IBC 2009")
'run analysis
   System.IO.Directory.CreateDirectory("c:\CSI_API_temp")
   ret = SapModel.File.Save("C:\CSI_API_temp\example.edb")
   ret = SapModel.Analyze.RunAnalysis
'start concrete design
   ret = SapModel.DesignConcrete.StartDesign()
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cDesignConcrete Interface
ETABSv1 Namespace